#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "aaafa64d20354f1bf151124136f76a33" -> "26a3b08a75988a684c0889a48372b017"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4df5d7691f52560d5955787679151191" -> "a432dc8b5296cb68474fc5b6cc92b674"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "64cc325ec90ea68504f6b50ce4e4bca1" -> "9e6409ed34608285c121f7f6e6d5172a"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "86bb915513edd14a57fb91b44ae8d00d" -> "01282056eba1c661b253e669a4317662"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "c341ae1bbffc22274fc31a7ea448ab8a" -> "cc49d8e9ac351337f955638c1d592a46"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "3c6e9c74c7061f747a2897412f75ad5a" -> "d11002eb9ddf87612677873691ee1a52"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "ffa60d5cb2b07049816975900d2214c4" -> "0ede09a98e708feb86d94568ccff8962"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "aaa32839d3b34c6ed5452595e1168ea8" -> "f34ace25ce7c43bb609ed3ad3a62ea9a"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "e235172dd15cc7dd312aded7ba4acf21" -> "6960e3cfd451343c29628887be994cfe"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "5dcac26e20635e5f5b08aa6fa74c64cc" -> "b8ef32f19f29329d89b27d2078227911"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "6d05ece71b1b083336dbd8d607bdffa0" -> "2856772db0aee3bc58f87780ffb4aedd"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "c00b7077af1fb38780c4395c6d2dd4be" -> "1b29f4121fc4cbbe09891a5aee4bd285"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4cc374f6e5a8de89efaea95623f3bcb8" -> "0ddacdfddf8222ab8a2d1795737594dd"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "475ad51a40f882cc715671a05d8c1853" -> "89f474df013edad9672a558424972dd5"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "a933cb2b456fa38064aca50158484aa5" -> "4970c40bf783a1e8db9a4bc780c3818f"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "072df4221ffbc23687152072f2e09279" -> "a7e6830b4227bb8609da7c3797954543"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "9d9f43393edf63f563c65b968f0a2493" -> "de0d00f970374a92659860a0a48b9f66"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "1f123b0fd7f72c50f6b76afd0ece8375" -> "b2b4be298e3a94a19fef0a50f0679a44"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "4c292f23bc02070b33992596f5fb1212" -> "2862b849d4fcc31611bfbe0c50ca5aef"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8fbb1ec469b1fbb1edfb595bc18758e2" -> "e1797e93bfba636e1d1dc3ce338e9d5b"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "f77c0398f13d80e2f137e2c876ece89a" -> "4a73eb2ffcd7511cb11c3ce64ca79222"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "88a8d738041fcd274984ad230e0a863b" -> "b61ff417c57aa57593f915d1ee697b37"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "6a9da0c1b445f9a7ff3e8720919779a9" -> "4ffea187df06f852895d5b8d598faa2d"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "cbd9736418ca7a78ea4077cf089e1fb2" -> "0193c13cca67ef1ca404b1445d7d2813"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "040ae9d8f398d75bdf40a56b59309f64" -> "199d8dfb7d4b246f7c72052a2f1aecc4"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "792f2c860d44635bd57fec3e4291e91c" -> "6bacf50780cdf3e14faa9de838233e90"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "39dc456180341cfcc1a1b066b545e4e4" -> "d801e40245a413b403c769fb09114ddc"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6e00cf7d81217d3397f1fdcd5d2be01e" -> "bb5666b853825a0b42737256948cee2d"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "33db68fb40e1aa9029b96862491da873" -> "bbbce169c9968a68d89ee7d991709466"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "fd061333ad6d2e461cda907bee49c220" -> "c312c3b2f486a46fdfa3b89e92b876fb"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "bfd8c737950516e1ddd28e1135c45565" -> "01fd55066483a923044492688e53e7eb"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f7cd4d4c17d95f6c474584bbf3a9cf35" -> "5639c1ec9f2123285bee1078a06225bc"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "474cf58c84c75e89f1137753d8234fc0" -> "9627bb9105a322b4298ed002af4bffe9"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0bf87652b964b88327162abfb2439e70" -> "495528d8636acbb6057c6dc6402e4783"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7b8c25db26188128d991076c12dfde4" -> "15cd7cb9d3cf907623d76b837511f063"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5aeeecf18cdafd21dd0a0904a8266c37" -> "4fcf8e6628da6083d81ea8961c773560"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ab19312ad691501a1ea42c977f891b53" -> "3826be950cd5a38b6c4ec5986dfa90c5"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "4d9c93dd3dca13a28707483429e987a1" -> "84fb1ce077f362dde6669b071e8b263a"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "cd1a93977d7edf03a63d39c93f641ddf" -> "4ac8eb36d4084cfd6d2ecfd8d5b9fedb"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0dfefd94f0fc486f2dd3155cfaee19dc" -> "fac65bb6399ae614c105ef42beac8979"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ce975857d3991c83ba090e543c582cbc" -> "7aacac49f133c73aad199f3edefca142"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "8ad1163529d160dd762b100389087af1" -> "f2f2716f4d8aaabe340b99de881e71a2"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "a9818148d2fa3478936d5a2ac951aa58" -> "687d13eef5f50adc07f4d111b7036098"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "ed026282f7638c4fb0da9964a8b4690b" -> "20ab8520eb6b9c82e84f942661e04b0a"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4a12dff2f92a4c2591b073f3b4f9ba0d" -> "ac600f736dd9a7d454a0e8c77263d68d"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "dMJ2RYetyQOoHUnk7C1mb/Ycpc2FhXeegai4TyQDQyg=" -> "HJUMAwg9axoRQchOtiW7eE0DEovNPz3LN36Gi22AXfM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Vflc/oDO1NaiARlJ79MCD+NZMpnm6RW1kte4kf+H7Y=" -> "zaHoUiKgDaid2dupHCjmWYQaxBdL+uHuH0I6KwEAE0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pihLiUwQJu6AapPyWgxKNfK46ikiqY5+9WK5XEH8XX4=" -> "U8Jgu2cGc27cl1a1JL+Bgs/qqjzKF10A6pw4jhKZwfw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZJF0NwOtbAvM7GM6KMWW7z9OYesOkNu4mKoh9YYxzg=" -> "gtCKS5zboAlt6/1OlqcGroBF3AB4uxbSWoSg7mylFzI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "ifa6ecCsSSYmcPxGFQZaJwApiEMPJwLEJBuEcWJj1Bs=" -> "fOIJEgl/+ZcR0DcrliNLcV5YCRD8oyu9uKJgFQpt3Kk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "AiMC9UqpZAzTLmA/Gef9JslDtV/SePhz4rw5bos9yno=" -> "7oTLnPntAt7NdheRpdDGx8qxI5iJ6li9aBNFz9P6gw8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hrPx9aVzHTKz9OJA4giT1iviLi3M5mxx4YD2YIxzkXg=" -> "g1fJfxVuwRE8jVNwfBHW6lmn2XzcAlkC6TRgq6WMXIA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "yYpNueJAJ7l2Ni/a24CVJMwtTiwTrqdyh6rMpIUbZYk=" -> "0KTQu+4o2x0sidYUJ/sR4D6GLtrtVkdaVIG7/BYosQI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "uOZ2MS/hPze5HVwEy+FbdJW5okfwP0e6GtDDgu3ClCQ=" -> "w3Xaqt3gaa8q+qttJxgmbf0zHdn0nWq0Dly+7Xj4lII="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "LoDD41PuGrhcx3LgRnB872bKkehuRJsoLBP3wSHjcCQ=" -> "+mRrJrsWGfyAnNWK/U3HR6FqlyHVa0gft3YTSmQh34w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qtm5VrfPzAumb1aw2oMaSyQwLOIJqo+Tf8UJows4d1o=" -> "viSXWeiEYe1mG02uWVDrn8RzhLIduWmu9fZhCJ1ZpmQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "S7mMfi6GGx9IJpBMAY4pyUDDqTQulRlJ6iPh8mitu+4=" -> "h5O9PIXO/iRkFqgz16JrxSjgFe1Tg2Coj17YVtjy3ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "uigGW06hppx1vLtQxPYul/1c7Vm265YGax1V6fheCKI=" -> "upw8Y+y/xzI/H5OJatPKOGiDl5DHUsWwx885aiZLdJU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "JPUQRHCHIqTevZW014IFiwqrKNoSWCQFCJaT/jCgSsk=" -> "rmaUkkK8e19qlx3tMTP6dHXncqhijukRiEWcVX5VO6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Cn/ClkTNO4cvcJ1ATyhiJa6GsDrg5CPsCrAvu1Whiyc=" -> "dm/sgHDsj0rAPEWJtyZ92XtrdRJD4JAL36FeiNomqqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWvfcdb+0PGXLOJaAsvY7dOosGaIAIslv7lbjyetZGI=" -> "uN3+0izJnYljn8T0hdbE9HemzFYfv0NIoiEKk/T6XpA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "jVKBGrY9hRoK/I81vCNPnU6Bp8Cu4kjO5g94yXE6pyQ=" -> "mtUmpW4OrY2+vhVLkJ7zLB+mdcWln+6ueTH/2XDzfqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "SpQ/P45HZnwfaTaSfW0DNQLMpU+jeS2KVfiO4iWc0qg=" -> "hlAoPccSqe5EL8utznmorcV4NbPfUDGfZV/mDTzPdRw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "K4CKRPND3HkYc+VAxoMw10LTt/JadOIlt6n1MP0Enkc=" -> "WKNGtVnKeK9s28/pDNxA1keQWZrG58Rmfo94PFbn68Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-20T13:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "jm87YVgeseLWJCEHuz240OhiBxDYP6VHxrLLRwG0MwQ=" -> "fUq+djjbHbDQUt6BsxQV0AJVfy75J4umJ06kVacfisk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mk/6A4ma0TB6i+uAYmE6J6AOozGoadGvXnDSVYfJaJ0=" -> "TYb6SSC6M3FnUD3bUkfdHI1g1b/q1YD9HDfpJolSW8U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "EvAvj2UeUZy9E2s9RZcvIu/3QbXng/It33Arh6VrYtc=" -> "ezOJfCFcSHg9lqRZqt0JI+RLQJqwvRpT3HXQ4++sADo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "FUxZsh/66ln0GO8eRoywNiReMtBunldgcgyLsoX1P6k=" -> "3iGZxtV/2ChWM+ZAEzOgwpouGEJRpE4jpuud7M63K2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zm40WvcsB9TNc/n/lLSNIzuONtiUMmDPcTUPEMdmnIk=" -> "YGfO83Y3veh8sDNw/hC8kjnMhW/Cw4FBXIc8GiquaQA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFRHKuAI8DwuegERcWoPyFt5hvOkCpmoarHeGqE4Rrg=" -> "FnX0LkfY78my/Y1uUqJyQ0wJLe6ayeHcPe1Nor01sYo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-22T19:16:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "34or47qLyr0furE1F7AF4Jp8w7c++n02wdAhKQPgqTo=" -> "M7jR4r7ZefRK6jRdzQYLsyvO1nbCSF5I2Y33Wnf/rJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ez+qbKyzvqpGbmFUsAA7uQe9AYt49tYhNK2cZl5uuB4=" -> "3K7zdwAJmBqZBQErd5mhhU43XIwTyP9wrvcKz+gorF8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "zo2UWO11JBGnwI+S/V00/bq2zKztDAbL6s2drtLe6qo=" -> "wuAwaO328PNXahhz0JfzCeBRYWtt+SXXCm8932Dy5MI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "CpN7kXf5BUpDhjbkhsq7h7C3MBzf6QH6tYkjgmGLRB4=" -> "bcLFwxVi7tE2u3wCWJRhwGqPRGhg/OnihbCiP14DeOQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TayHhkgRq08oBb8vvpKuLWrDhXCys7lMn9WX1DwhK0I=" -> "m3Z5inzBw0DSUumL7YpjpvEEhAJ1rRHcVR8/5vZDMYc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "5N6rh+9in1mbdi3B54s/pLEbkFYy6HaX5epBIC4QYxI=" -> "e7KnWDlOcxL+kn1uCg/CLGgH2wRnZdOBGAAkN24d5Gc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "L84tKCG1qsTT7lE/qaD+GXHvZvX8lYZy1/Kl/WeVnpI=" -> "Tj1oRJmyHnfYh36p2ensxwmByX8Z7ztm1A91UeqerQ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "icQ4SD6Z0Rzv+Ao1v0YatTXbtWGAKir649AUhOW6rJs=" -> "Dgr7YHfnabr8g505zGimkPWKjoT5Vb55OZh/JY/PMAA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XDV7p7EFXK7uUyWKrqqC7yRCGY2Wz37PHw5u/rgTTGQ=" -> "PgzQXakK8RHX9tNVOllWjthTvTehgNKEOnY23u37t94="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "3M1Cj9yZ81J8DyA1hLr4W9tGOTpDZ1bYAp/jtrJ8vqc=" -> "KzDCLDo22+m+YixG7HzsrIgMOajvTLF4hYmiLkT58mw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "WTQ3fdHgGUAUsf/cJCk5sZBpsxTXruVgqitFqUqe44I=" -> "CbFctMt2191s76AsntGApFiL/OjVr2vJN2cyCRcjzNE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "hEd7mdbyJzq9Q4TrdZkvTjd6c/9LE5NNqvVJPwWA480=" -> "MA3Df9xzsdqjOfr7IipWwexLYB2mSmqUxkZpqQh6X18="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "B5dRypOnUx0Kw+aRB1XcwvyBA+fs3cBlSC66Sdp4+wA=" -> "G90rEoaV6SPc+3dM1AkC38Y2fQCh8ZI203EGjf5zUcQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "ISTmuW3opF9ke6bTCLv3qInFZgiMI0TXtYyLa7H7xu0=" -> "GoT6mjlE768QT5OHT1UzjCTKR2Sgp1AznSXmvciLbUg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "+GdiKRF6JkyixBnptQEFbdEwQ1aARI2YWWZOoG7mc/g=" -> "48kS1j9WVeOZwWZWwDt38DcOr9tWnLvP3Q8t15rfKM4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-15T20:58:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "2pBtKLBB4TJm2OYYC6MFDTiXTl//uP5wN3uwfbL3MSs=" -> "NDHH5QBqPFMg31GDFTB85VeaR1glblQi329SkFwSsFI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ALCqK5jK2Ms+4Cq/ZaGIM3qkYOUpXF9VFW2Lra2zKoQ=" -> "nXhglvC4yz1Cuq1H53D5Xt0oeGCvDROMwugc5Sbqic8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9CBtcCh+khAXW/zd6pEp1Bok0sqX1YFYbvRvdT1PHE=" -> "gyHsLHsla7PvSxTprtvydA9AAJBElMJoz/4S1lD4xQk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-15T20:57:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "LDA67S1nSq2oZgjLN4yI+RszXHWfX6oTN47dst398O8=" -> "2e0CIpeHk9UDThN4AclOYqWRXXvHbajk5p6YlUkXKQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-15T20:57:31Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "y2uxop" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-15T20:57:30Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-15T20:57:29Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*